---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.ExtendToOthersWarn
source: html/46c70139-26a9-139a-b6ba-f6d985275856.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.ExtendToOthersWarn Property

Can't keep [Type Name] extended to [Type Name].

## Syntax (C#)
```csharp
public static FailureDefinitionId ExtendToOthersWarn { get; }
```